FEAFIP V4/Ejemplos/VB6/Facturas con detalle (wsmtxca)/Request.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><autorizarComprobanteRequest xmlns="http://impl.service.wsmtxca.afip.gov.ar/service/"><authRequest xmlns=""><token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgdW5pcXVlX2lkPSIxNDA1MTQ3NjI5IiBnZW5fdGltZT0iMTU2Nzc5MzMwMSIgZXhwX3RpbWU9IjE1Njc4MzY1NjEiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NtdHhjYSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDkzOTgwMjU5MywgQ049bG9naW4iIGF1dGhtZXRob2Q9ImNtcyIgcmVnbWV0aG9kPSIyMiI+CiAgICAgICAgICAgIDxyZWxhdGlvbnM+CiAgICAgICAgICAgICAgICA8cmVsYXRpb24ga2V5PSIyMDkzOTgwMjU5MyIgcmVsdHlwZT0iNCIvPgogICAgICAgICAgICA8L3JlbGF0aW9ucz4KICAgICAgICA8L2xvZ2luPgogICAgPC9vcGVyYXRpb24+Cjwvc3NvPgo=</token><sign>AySiU7ouem0td8peW51JLGITn0+qRkl/4Ao4dzB5L6bUoOXqACnLWjZ+4zIwB7oxn5DrCxmaAJ0Hkqcmbbi1K9FUT5z8v8+sYi6d8p0XuwHhO3Bj2yEt32AZwOEB8i6z7tLfNxMjw8tgwjtzftIXqio5Iiocw574yxb6YtASA9E=</sign><cuitRepresentada>20939802593</cuitRepresentada></authRequest><comprobanteCAERequest xmlns=""><codigoTipoComprobante>1</codigoTipoComprobante><numeroPuntoVenta>110</numeroPuntoVenta><numeroComprobante>3376</numeroComprobante><fechaEmision>2019-09-06</fechaEmision><codigoTipoDocumento>80</codigoTipoDocumento><numeroDocumento>30702637895</numeroDocumento><importeGravado>100</importeGravado><importeNoGravado>0</importeNoGravado><importeExento>0</importeExento><importeSubtotal>100</importeSubtotal><importeTotal>121</importeTotal><codigoMoneda>PES</codigoMoneda><cotizacionMoneda xsi:type="ImporteTotalSimpleType">1</cotizacionMoneda><codigoConcepto>1</codigoConcepto><arrayItems><item><unidadesMtx>1</unidadesMtx><codigoMtx>articulo1</codigoMtx><codigo>articulo1</codigo><descripcion>descripcion arti 1</descripcion><cantidad>1</cantidad><codigoUnidadMedida>1</codigoUnidadMedida><precioUnitario>100</precioUnitario><importeBonificacion>0</importeBonificacion><codigoCondicionIVA>5</codigoCondicionIVA><importeIVA>21</importeIVA><importeItem>121</importeItem></item></arrayItems><arraySubtotalesIVA><subtotalIVA><codigo>5</codigo><importe>21</importe></subtotalIVA></arraySubtotalesIVA></comprobanteCAERequest></autorizarComprobanteRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
